cask_args appdir: '/Applications', require_sha: true

# Taps ===================================================================================================================
tap 'homebrew/core' # Homebrew core
tap 'homebrew/cask' # GUI macOS apps
tap 'buo/cask-upgrade' # Brew cask upgrade
tap 'homebrew/cask-versions' # Alternate versions
tap 'homebrew/services' # Integrates Homebrew formulae with macOS' `launchctl` manager
tap 'homebrew/bundle' # Homebrew bundle for automation
brew 'mas' # Mac App Store command line interface
tap 'martido/homebrew-graph' # Dependency graph of Homebrew formulaes
# ========================================================================================================================

# Fonts ==================================================================================================================
tap 'homecask/cask-fonts' # https://github.com/ryanoasis/nerd-fonts

cask 'font-fira-code' # https://github.com/tonsky/FiraCode
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono' # https://github.com/mozilla/Fira
cask 'font-fira-mono-nerd-font'
cask 'font-hack' # https://sourcefoundry.org/hack/ https://github.com/source-foundry/Hack
cask 'font-hack-nerd-font'
cask 'font-jetbrains-mono' # https://www.jetbrains.com/lp/mono/ https://github.com/JetBrains/JetBrainsMono
cask 'font-jetbrains-mono-nerd-font'
cask 'font-source-code-pro' # https://adobe-fonts.github.io/source-code-pro/ https://github.com/adobe-fonts/source-code-pro
cask 'font-sauce-code-pro-nerd-font'
cask 'font-terminess-ttf-nerd-font' # https://terminus-font.sourceforge.net
cask 'font-victor-mono' # https://rubjo.github.io/victor-mono/ https://github.com/rubjo/victor-mono
cask 'font-victor-mono-nerd-font'
# ========================================================================================================================

# Cli ====================================================================================================================

# Shells -----------------------------------------------------------------------------------------------------------------
brew 'bash' # https://www.gnu.org/software/bash/
brew 'fish' # https://fishshell.com https://github.com/fish-shell/fish-shell
brew 'zsh' # https://www.zsh.org https://github.com/zsh-users/zsh
# ------------------------------------------------------------------------------------------------------------------------

# Terminals --------------------------------------------------------------------------------------------------------------
cask 'alacritty' # https://alacritty.org https://github.com/alacritty/alacritty
cask 'iterm2' # https://iterm2.com https://github.com/gnachman/iTerm2
cask 'kitty' # https://sw.kovidgoyal.net/kitty/ https://github.com/kovidgoyal/kitty
# ------------------------------------------------------------------------------------------------------------------------

# Tools ------------------------------------------------------------------------------------------------------------------
brew 'bat' # https://github.com/sharkdp/bat
brew 'ccat' # https://github.com/owenthereal/ccat
brew 'curl' # https://github.com/curl/curl
brew 'ctags' # https://github.com/universal-ctags/ctags
brew 'diff-so-fancy' # https://github.com/so-fancy/diff-so-fancy
brew 'exa' # https://github.com/ogham/exa
brew 'lsd' # https://github.com/Peltoche/lsd
brew 'fswatch' # https://github.com/emcrisostomo/fswatch
brew 'fzf' # https://github.com/junegunn/fzf
brew 'gnupg' # https://github.com/gpg/gnupg
brew 'gpg-tui' # https://github.com/orhun/gpg-tui
brew 'highlight' # http://www.andre-simon.de/doku/highlight/highlight.php
brew 'imagemagick' # https://github.com/ImageMagick/ImageMagick
brew 'jq' # https://github.com/stedolan/jq
brew 'moreutils' # https://joeyh.name/code/moreutils/
brew 'neofetch' # https://github.com/dylanaraps/neofetch
brew 'macchina' # https://github.com/Macchina-CLI/macchina
brew 'openssl' # https://github.com/openssl/openssl
brew 'rclone' # https://github.com/rclone/rclone
brew 'systemfd' # https://github.com/mitsuhiko/systemfd
brew 'tldr' # https://github.com/tldr-pages/tldr
brew 'translate-shell' # https://github.com/soimort/translate-shell
brew 'tmux' # https://github.com/tmux/tmux
brew 'vifm' # https://github.com/vifm/vifm
brew 'vip' # https://users.cs.duke.edu/~des/vip.html
brew 'wget' # https://www.gnu.org/software/wget/
brew 'watchman' # https://github.com/facebook/watchman
brew 'xz' # https://github.com/xz-mirror/xz
brew 'youtube-dl' # https://github.com/ytdl-org/youtube-dl
brew 'yt-dlp' # https://github.com/yt-dlp/yt-dlp
# ------------------------------------------------------------------------------------------------------------------------

# Search -----------------------------------------------------------------------------------------------------------------
brew 'ack' # https://beyondgrep.com https://github.com/beyondgrep/ack3
brew 'fd' # https://github.com/sharkdp/fd
brew 'ripgrep' # https://github.com/BurntSushi/ripgrep
brew 'the_silver_searcher' # https://geoff.greer.fm/ag/ https://github.com/ggreer/the_silver_searcher
# ------------------------------------------------------------------------------------------------------------------------

# Editors ----------------------------------------------------------------------------------------------------------------
brew 'vim' # https://github.com/vim/vim
brew 'neovim' # https://github.com/neovim/neovim
# ------------------------------------------------------------------------------------------------------------------------

# Git --------------------------------------------------------------------------------------------------------------------
brew 'git' # https://git-scm.com https://github.com/git/git
brew 'git-lfs' # https://git-lfs.com https://github.com/git-lfs/git-lfs
brew 'git-flow-avh' # https://github.com/petervanderdoes/gitflow-avh
brew 'git-extras' # https://github.com/tj/git-extras
brew 'git-secrets' # https://github.com/awslabs/git-secrets
brew 'lazygit' # https://github.com/jesseduffield/lazygit
brew 'pinentry-mac' # https://github.com/GPGTools/pinentry
brew 'gh' # https://cli.github.com https://github.com/cli/cli
# ------------------------------------------------------------------------------------------------------------------------

# Media ------------------------------------------------------------------------------------------------------------------
brew 'mpd' # https://www.musicpd.org https://github.com/MusicPlayerDaemon/MPD
brew 'mpv' # https://mpv.io https://github.com/mpv-player/mpv
brew 'ncmpc' # https://github.com/MusicPlayerDaemon/ncmpc
brew 'ncmpcpp' # https://github.com/ncmpcpp/ncmpcpp
# ------------------------------------------------------------------------------------------------------------------------

# Monitoring -------------------------------------------------------------------------------------------------------------
brew 'htop' # https://htop.dev https://github.com/htop-dev/htop
brew 'bottom' # https://clementtsang.github.io/bottom/ https://github.com/ClementTsang/bottom
# ------------------------------------------------------------------------------------------------------------------------

## Network ---------------------------------------------------------------------------------------------------------------
brew 'nmap' # https://nmap.org
brew 'wrk' # https://github.com/wg/wrk
# ------------------------------------------------------------------------------------------------------------------------
# ========================================================================================================================

# Development ============================================================================================================
# Languages --------------------------------------------------------------------------------------------------------------

# C
brew 'cmake' # https://cmake.org https://gitlab.kitware.com/cmake/cmake
brew 'llvm' # https://llvm.org https://github.com/llvm/llvm-project
brew 'gcc' # https://gcc.gnu.org https://gcc.gnu.org/git/gcc.git
brew 'gdb' # https://www.gnu.org/software/gdb https://sourceware.org/git/binutils-gdb.git

# Python
brew 'python' # https://www.python.org https://github.com/python/cpython
brew 'pyenv' # https://github.com/pyenv/pyenv

# Swift
brew 'swiftlint' # https://github.com/realm/SwiftLint

# PHP
brew 'php' # https://www.php.net https://github.com/php/php-src
brew 'composer' # https://getcomposer.org https://github.com/composer/composer

# NodeJS
brew 'nvm' # https://nodejs.org https://github.com/nodejs/node
brew 'fnm' # https://github.com/Schniz/fnm
brew 'node' # https://github.com/nvm-sh/nvm

# Java
brew 'temurin' # https://adoptium.net/temurin/

# Go
brew 'go' # https://go.dev/doc/ https://github.com/golang/go

# Kotlin
brew 'kotlin' # https://kotlinlang.org https://github.com/JetBrains/kotlin

# Ruby
brew 'ruby' # https://www.ruby-lang.org https://github.com/ruby/ruby
brew 'rbenv' # https://github.com/rbenv/rbenv

# Rust
brew 'rustup-init' # https://www.rust-lang.org https://rust-lang.github.io/rustup https://github.com/rust-lang/rustup
brew 'rust-analyzer' # https://rust-analyzer.github.io https://github.com/rust-lang/rust-analyzer

# Shellscript
brew 'shellcheck' # https://www.shellcheck.net https://github.com/koalaman/shellcheck

# Databases
brew 'postgresql' # https://www.postgresql.org https://github.com/postgres/postgres
brew 'redis' # https://redis.io https://github.com/redis/redis
brew 'sqlite' # https://www.sqlite.org https://github.com/sqlite/sqlite
brew 'mysql' # https://www.mysql.com https://github.com/mysql/mysql-server
brew 'pgcli' # https://www.pgcli.com 
brew 'mycli' # https://www.mycli.net https://github.com/dbcli/mycli
cask 'tableplus' # https://tableplus.com

# IDEs
cask 'visual-studio-code' # https://code.visualstudio.com https://github.com/microsoft/vscode
cask 'visual-studio-code-insiders' # https://code.visualstudio.com/insiders/
cask 'intellij-idea' # https://www.jetbrains.com/idea/

# DevOps
# Ansible
brew 'ansible' # https://www.ansible.com https://github.com/ansible/ansible
brew 'ansible-lint' # https://github.com/ansible/ansible-lint

# Docker
cask 'docker' # https://www.docker.com https://github.com/docker
brew 'lazydocker' # https://github.com/jesseduffield/lazydocker

# Kubernetes
brew 'kubernetes-cli' # https://kubernetes.io https://github.com/kubernetes/kubernetes
brew 'k9s' # https://k9scli.io https://github.com/derailed/k9s
brew 'minikube' # https://minikube.sigs.k8s.io/docs/ https://github.com/kubernetes/minikube
brew 'kompose' # https://kompose.io https://github.com/kubernetes/kompose
brew 'kustomize' # https://kustomize.io https://github.com/kubernetes-sigs/kustomize

# Terraform
brew 'terraform' # https://www.terraform.io https://github.com/hashicorp/terraform
brew 'tfenv' # https://github.com/tfutils/tfenv
brew 'helm' # https://helm.sh https://github.com/helm/helm

# Cloud cli
brew 'awscli' # https://aws.amazon.com/cli/ https://github.com/aws/aws-cli
cask 'google-cloud-sdk' # https://cloud.google.com/cli
brew 'azure-cli' # https://learn.microsoft.com/cli/azure/ https://github.com/Azure/azure-cli

# iOS
brew 'xcodes' # https://github.com/RobotsAndPencils/xcodes
cask 'xcodes' # https://github.com/RobotsAndPencils/XcodesApp
brew 'xcodegen' # https://github.com/yonaskolb/XcodeGen
brew 'carthage' # https://github.com/Carthage/Carthage
brew 'cocoapods' # https://github.com/CocoaPods/CocoaPods
cask 'ios-app-signer' # https://www.iosappsigner.com https://github.com/DanTheMan827/ios-app-signer

# Android
cask 'android-studio' # https://developer.android.com/studio/
brew 'gradle' # https://gradle.org

# API
cask 'postman' # https://www.postman.com
cask 'insomnia' # https://insomnia.rest https://github.com/Kong/insomnia

# Forensic
brew 'radare2' # https://www.radare.org/ https://github.com/radareorg/radare2
cask 'cutter' # https://cutter.re https://github.com/rizinorg/cutter

# Virtualization
cask 'virtualbox' # https://www.virtualbox.org
cask 'virtualbox-extension-pack'
brew 'qemu' # https://www.qemu.org https://github.com/qemu/qemu
cask 'utm' # https://getutm.app https://github.com/utmapp/UTM
# ------------------------------------------------------------------------------------------------------------------------

# ========================================================================================================================

# Apps ===================================================================================================================

# macOS ------------------------------------------------------------------------------------------------------------------
# Homebrew GUI management
cask 'cakebrew' # https://www.cakebrew.com https://github.com/brunophilipe/Cakebrew

# Swiss Army Knife for macOS
brew 'm-cli' # https://github.com/rgcr/m-cli

# QuickLook plugins | https://github.com/sindresorhus/quick-look-plugins https://www.quicklookplugins.com/
# macOS > Catalina need to remove the quarantine attributes
# Check attributes: xattr -r ~/Library/QuickLook
# Remove attributes: xattr -d -r com.apple.quarantine ~/Library/QuickLook
# Restart QuickLook manager: qlmanage -r
cask 'qlvideo', args: { no_quarantine: true } # https://github.com/Marginal/QLVideo
cask 'syntax-highlight', args: { no_quarantine: true } # https://github.com/sbarex/SourceCodeSyntaxHighlight
cask 'suspicious-package' # https://mothersruin.com/software/SuspiciousPackage/
cask 'apparency' # https://www.mothersruin.com/software/Apparency/
# ------------------------------------------------------------------------------------------------------------------------

# Web browsers -----------------------------------------------------------------------------------------------------------
cask 'google-chrome' # https://www.google.com/chrome/
cask 'chromedriver' # https://chromedriver.chromium.org/downloads
cask 'firefox' # https://www.mozilla.org/firefox/
#cask 'firefox-developer-edition' # https://www.mozilla.org/firefox/developer/
brew 'geckodriver' # https://github.com/mozilla/geckodriver
cask 'vivaldi' # https://vivaldi.com
cask 'microsoft-edge' # https://www.microsoft.com/edge
# ------------------------------------------------------------------------------------------------------------------------

# Screensaver 
cask 'brooklyn' # https://github.com/pedrommcarrasco/Brooklyn
# ------------------------------------------------------------------------------------------------------------------------

# Monitoring
cask 'stats' # https://github.com/exelban/stats
# ------------------------------------------------------------------------------------------------------------------------

# Calendar
cask 'itsycal' # https://www.mowglii.com/itsycal/
# ------------------------------------------------------------------------------------------------------------------------

# Translation
mas 'Translate Tab', id: 458887729 # https://apps.apple.com//app/translate-tab/id458887729
# ------------------------------------------------------------------------------------------------------------------------

# Utilities -
cask 'appcleaner' # https://freemacsoft.net/appcleaner
cask 'cheatsheet' # https://www.mediaatelier.com/CheatSheet
cask 'dozer' # https://github.com/Mortennn/Dozer
#TODO: HIDE BAR

cask 'karabiner-elements' # https://karabiner-elements.pqrs.org https://github.com/pqrs-org/Karabiner-Elements

# ------------------------------------------------------------------------------------------------------------------------

# Window management
mas 'Magnet', id: 441258766 # https://magnet.crowdcafe.com
cask 'rectangle' # https://rectangleapp.com https://github.com/rxhanson/Rectangle
cask 'tiles' # https://freemacsoft.net/tiles/
cask 'amethyst' # https://ianyh.com/amethyst/ https://github.com/ianyh/Amethyst
#tap 'koekeishiya/formulae' 
#brew 'koekeishiya/formulae/yabai' # https://github.com/koekeishiya/yabai
#brew 'koekeishiya/formulae/skhd' # https://github.com/koekeishiya/skhd
# ------------------------------------------------------------------------------------------------------------------------

# Clipboard management
cask 'maccy' # https://maccy.app https://github.com/p0deje/Maccy
cask 'yippy' # https://yippy.mattdavo.com https://github.com/mattDavo/Yippy
mas 'Pasta', id: 1438389787 # https://getpasta.com

# ------------------------------------------------------------------------------------------------------------------------

# VPN
#cask 'tunnelblick' # https://tunnelblick.net/downloads.html https://github.com/Tunnelblick/Tunnelblick
cask 'tunnelblick-beta' # For version 4
mas 'WireGuard', id: 1451685025 # https://www.wireguard.com

# File archiver
cask 'keka' # https://www.keka.io
cask 'kekaexternalhelper' # https://github.com/aonez/Keka/wiki/Default-application

# Image
cask 'imageoptim' # https://imageoptim.com/mac https://github.com/ImageOptim/ImageOptim
cask 'kap' # https://getkap.co https://github.com/wulkano/kap

# FTP/SFTP
cask 'cyberduck' # https://cyberduck.io https://github.com/iterate-ch/cyberduck

# Torrent
cask 'transmission' # https://transmissionbt.com https://github.com/transmission/transmission

# Languages
cask 'anki' # https://apps.ankiweb.net

# Design
# mas 'Affinity Designer', id: 824171161
mas 'Affinity Designer 2', id: 1616831348 # https://affinity.serif.com/designer/
# mas 'Affinity Photo', id: 824183456
mas 'Affinity Photo 2', id: 1616822987 # https://affinity.serif.com/photo/
# mas 'Affinity Publisher', id: 881418622
mas 'Affinity Publisher 2', id: 1606941598 # https://affinity.serif.com/publisher/
cask 'blender' # https://www.blender.org https://github.com/blender/blender
cask 'godot' # https://godotengine.org https://github.com/godotengine/godot
cask 'inkscape' # https://inkscape.org https://gitlab.com/inkscape/inkscape
cask 'krita' # https://krita.org https://github.com/KDE/krita
# ------------------------------------------------------------------------------------------------------------------------

# Microsoft Office
cask 'microsoft-office' # https://macadmins.software
cask 'microsoft-auto-update'
#mas 'Microsoft OneNote', id: 784801555
# ------------------------------------------------------------------------------------------------------------------------

# SNS
mas 'Slack', id: 803453959 # https://slack.com
mas 'Telegram', id: 747648890 # https://telegram.org
mas 'LINE', id: 539883307 # https://line.me
mas 'KakaoTalk', id: 869223134 # https://www.kakaocorp.com/page/service/service/KakaoTalk
mas 'WeChat', id: 836500024 # https://www.wechat.com
cask 'skype' # https://www.skype.com 
brew 'weechat' # https://weechat.org https://github.com/weechat/weechat
# ------------------------------------------------------------------------------------------------------------------------

# Git
cask 'fork' # https://fork.dev https://git-fork.com
# ------------------------------------------------------------------------------------------------------------------------

# Enterteinment ----------------------------------------------------------------------------------------------------------
# eBooks
cask 'calibre' # https://calibre-ebook.com https://github.com/kovidgoyal/calibre

# Players
cask 'iina' # https://iina.io https://github.com/iina/iina
cask 'kodi' # https://kodi.tv https://github.com/xbmc/xbmc
cask 'vlc' # https://www.videolan.org/vlc/ https://github.com/videolan/vlc

# Encoders
cask 'handbrake' # https://handbrake.fr https://github.com/HandBrake/HandBrake
# ------------------------------------------------------------------------------------------------------------------------

# ========================================================================================================================

# Gaming =================================================================================================================

# Emulators --------------------------------------------------------------------------------------------------------------
cask 'openemu' # https://openemu.org https://github.com/OpenEmu/OpenEmu

# Nintendo 3DS
cask 'citra' # https://citra-emu.org https://github.com/citra-emu/citra
# ------------------------------------------------------------------------------------------------------------------------

# ========================================================================================================================


mas 'Amphetamine', id: 937984704
mas 'AdGuard for Safari', id: 1440147259
cask 'hiddenbar' # https://github.com/dwarvesf/hidden
#mas 'Hidden Bar', id: 1452453066 # No new versions on Mac App Store

mas 'Pixelmator Pro', id: 1289583905 # https://www.pixelmator.com/pro/
mas 'DuckDuckGo', id: 663592361 # https://duckduckgo.com
cask 'rayscast' # https://www.raycast.com